000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/КопированиеАкций/КопированиеАкций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КопированиеАкций</name>
  <attributes>
    <name>МаркетинговаяАкция</name>
    <type>
      <types>DocumentRef.МаркетинговаяАкция</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.ПрограммыЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательСкидки</name>
    <type>
      <types>CatalogRef.ГруппыПолучателейСкидки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>999</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаЗамены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>999</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МенятьНазвание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/КопированиеАкций/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Команда1(Команда)
Если Не ЗначениеЗаполнено(Объект.МаркетинговаяАкция) Тогда
        Сообщить("Выберите исходную маркетинговую акцию!");
        Возврат;
    КонецЕсли;
    
    СозданнаяАкция = СоздатьАкциюНаСервере();
    
    Если ЗначениеЗаполнено(СозданнаяАкция) Тогда
        ПоказатьЗначение(, СозданнаяАкция); 
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция СоздатьАкциюНаСервере()
    
    КэшСкидок = Новый Соответствие;
    КэшУсловий = Новый Соответствие;
    
    НачатьТранзакцию();
    Попытка
        НоваяАкция = Объект.МаркетинговаяАкция.Скопировать();
        
        Если ЗначениеЗаполнено(Объект.СтрокаПоиска) И ЗначениеЗаполнено(Объект.СтрокаЗамены) И Объект.МенятьНазвание Тогда
            НоваяАкция.НаименованиеАкции = СтрЗаменить(НоваяАкция.НаименованиеАкции, Объект.СтрокаПоиска, Объект.СтрокаЗамены);
        КонецЕсли;
        
        НоваяАкция.Дата = ТекущаяДатаСеанса();
        НоваяАкция.СкидкиНаценки.Очистить();
        
        Для Каждого СтрИзИсточник Из Объект.МаркетинговаяАкция.СкидкиНаценки Цикл
            
            СтараяСкидка = СтрИзИсточник.СкидкаНаценка;
            НоваяСкидкаСсылка = КэшСкидок.Получить(СтараяСкидка);
            
            Если НоваяСкидкаСсылка = Неопределено И ЗначениеЗаполнено(СтараяСкидка) Тогда
                
                НоваяСкидкаОбъект = СтараяСкидка.Скопировать();
                
                Если ЗначениеЗаполнено(Объект.СтрокаПоиска) И ЗначениеЗаполнено(Объект.СтрокаЗамены) Тогда
                    НоваяСкидкаОбъект.Наименование = СтрЗаменить(НоваяСкидкаОбъект.Наименование, Объект.СтрокаПоиска, Объект.СтрокаЗамены);
                КонецЕсли;
                
                Если ЗначениеЗаполнено(Объект.ПрограммаЛояльности) И НоваяСкидкаОбъект.ПрограммаЛояльности <> Объект.ПрограммаЛояльности Тогда
                    НоваяСкидкаОбъект.ПрограммаЛояльности = Объект.ПрограммаЛояльности;
                КонецЕсли;
                
                Для Каждого СтрУсловие Из НоваяСкидкаОбъект.УсловияПредоставления Цикл
                    
                    СтароеУсловие = СтрУсловие.УсловиеПредоставления;
                    НовоеУсловиеСсылка = КэшУсловий.Получить(СтароеУсловие);
                    
                    Если НовоеУсловиеСсылка = Неопределено И ЗначениеЗаполнено(СтароеУсловие) Тогда
                        НовоеУсловиеОбъект = СтароеУсловие.Скопировать();
                        
                        Если ЗначениеЗаполнено(Объект.СтрокаПоиска) И ЗначениеЗаполнено(Объект.СтрокаЗамены) Тогда
                            НовоеУсловиеОбъект.Наименование = СтрЗаменить(НовоеУсловиеОбъект.Наименование, Объект.СтрокаПоиска, Объект.СтрокаЗамены);
                        КонецЕсли;
                        НовоеУсловиеОбъект.Получатели.Очистить();
                        Если ЗначениеЗаполнено(Объект.ПолучательСкидки) Тогда
                            СтрПолучатель =  НовоеУсловиеОбъект.Получатели.Добавить();
                            СтрПолучатель.Получатель =  Объект.ПолучательСкидки;
                         КонецЕсли;
                        
                        НовоеУсловиеОбъект.Записать();
                        НовоеУсловиеСсылка = НовоеУсловиеОбъект.Ссылка;
                        КэшУсловий.Вставить(СтароеУсловие, НовоеУсловиеСсылка); 
                    КонецЕсли;
                    
                    СтрУсловие.УсловиеПредоставления = НовоеУсловиеСсылка;
                КонецЦикла;
                
                НоваяСкидкаОбъект.Записать();
                НоваяСкидкаСсылка = НоваяСкидкаОбъект.Ссылка;
                КэшСкидок.Вставить(СтараяСкидка, НоваяСкидкаСсылка); 
            КонецЕсли;
            
            НоваяСтрока = НоваяАкция.СкидкиНаценки.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрИзИсточник);
            НоваяСтрока.СкидкаНаценка = НоваяСкидкаСсылка;
            
        КонецЦикла;
        
        НоваяАкция.Записать();
        ЗафиксироватьТранзакцию();
        
        Возврат НоваяАкция.Ссылка;
        
    Исключение
        ОтменитьТранзакцию();
        Сообщить("Ошибка при создании: " + ОписаниеОшибки());
        Возврат Неопределено;
    КонецПопытки;
    
КонецФункции

&НаКлиенте
Процедура СоздатьАкцию(Команда)
    
    Если Не ЗначениеЗаполнено(Объект.МаркетинговаяАкция) Тогда
        Сообщить("Выберите исходную маркетинговую акцию!");
        Возврат;
    КонецЕсли;
    
    СозданнаяАкция = СоздатьАкциюНаСервере();
    
    Если ЗначениеЗаполнено(СозданнаяАкция) Тогда
        ПоказатьЗначение(, СозданнаяАкция); 
    КонецЕсли;
    
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
	
	Если Параметры.Свойство("МаркетинговаяАкция") Тогда
		Объект.МаркетинговаяАкция = Параметры.МаркетинговаяАкция;
	КонецЕсли;	
	Объект.ПрограммаЛояльности = Справочники.ПрограммыЛояльности.НайтиПоКоду("000-0000001"); 
	Объект.ПолучательСкидки = Справочники.ГруппыПолучателейСкидки.НайтиПоНаименованию("Сотрудники"); 
КонецПроцедуры
